remotemcu/remcu-chip-sdks/SiLabs/Gecko_SDK/platform/Device/SiliconLabs/EFM32JG12B/Include/efm32jg12b500f512gl125.h
/**************************************************************************//**
 * @file efm32jg12b500f512gl125.h
 * @brief CMSIS Cortex-M Peripheral Access Layer Header File
 *        for EFM32JG12B500F512GL125
 * @version 5.1.2
 ******************************************************************************
 * @section License
 * <b>Copyright 2017 Silicon Laboratories, Inc. http://www.silabs.com</b>
 ******************************************************************************
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software.@n
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.@n
 * 3. This notice may not be removed or altered from any source distribution.
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Silicon Laboratories, Inc.
 * has no obligation to support this Software. Silicon Laboratories, Inc. is
 * providing the Software "AS IS", with no express or implied warranties of any
 * kind, including, but not limited to, any implied warranties of
 * merchantability or fitness for any particular purpose or warranties against
 * infringement of any proprietary rights of a third party.
 *
 * Silicon Laboratories, Inc. will not be liable for any consequential,
 * incidental, or special damages, or any other relief, or for any claim by
 * any third party, arising from your use of this Software.
 *
 *****************************************************************************/

#ifndef EFM32JG12B500F512GL125_H
#define EFM32JG12B500F512GL125_H

#ifdef __cplusplus
extern "C" {
#endif

/**************************************************************************//**
 * @addtogroup Parts
 * @{
 *****************************************************************************/

/**************************************************************************//**
 * @defgroup EFM32JG12B500F512GL125 EFM32JG12B500F512GL125
 * @{
 *****************************************************************************/

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ********************************************/
  NonMaskableInt_IRQn   = -14,              /*!< -14 Cortex-M3 Non Maskable Interrupt      */
  HardFault_IRQn        = -13,              /*!< -13 Cortex-M3 Hard Fault Interrupt        */
  MemoryManagement_IRQn = -12,              /*!< -12 Cortex-M3 Memory Management Interrupt */
  BusFault_IRQn         = -11,              /*!< -11 Cortex-M3 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10,              /*!< -10 Cortex-M3 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,               /*!< -5  Cortex-M3 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,               /*!< -4  Cortex-M3 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,               /*!< -2  Cortex-M3 Pend SV Interrupt           */
  SysTick_IRQn          = -1,               /*!< -1  Cortex-M3 System Tick Interrupt       */

/******  EFM32JG12B Peripheral Interrupt Numbers ********************************************/

  EMU_IRQn              = 0,  /*!< 0 EFM32 EMU Interrupt */
  WDOG0_IRQn            = 2,  /*!< 2 EFM32 WDOG0 Interrupt */
  WDOG1_IRQn            = 3,  /*!< 3 EFM32 WDOG1 Interrupt */
  LDMA_IRQn             = 9,  /*!< 9 EFM32 LDMA Interrupt */
  GPIO_EVEN_IRQn        = 10, /*!< 10 EFM32 GPIO_EVEN Interrupt */
  TIMER0_IRQn           = 11, /*!< 11 EFM32 TIMER0 Interrupt */
  USART0_RX_IRQn        = 12, /*!< 12 EFM32 USART0_RX Interrupt */
  USART0_TX_IRQn        = 13, /*!< 13 EFM32 USART0_TX Interrupt */
  ACMP0_IRQn            = 14, /*!< 14 EFM32 ACMP0 Interrupt */
  ADC0_IRQn             = 15, /*!< 15 EFM32 ADC0 Interrupt */
  IDAC0_IRQn            = 16, /*!< 16 EFM32 IDAC0 Interrupt */
  I2C0_IRQn             = 17, /*!< 17 EFM32 I2C0 Interrupt */
  GPIO_ODD_IRQn         = 18, /*!< 18 EFM32 GPIO_ODD Interrupt */
  TIMER1_IRQn           = 19, /*!< 19 EFM32 TIMER1 Interrupt */
  USART1_RX_IRQn        = 20, /*!< 20 EFM32 USART1_RX Interrupt */
  USART1_TX_IRQn        = 21, /*!< 21 EFM32 USART1_TX Interrupt */
  LEUART0_IRQn          = 22, /*!< 22 EFM32 LEUART0 Interrupt */
  PCNT0_IRQn            = 23, /*!< 23 EFM32 PCNT0 Interrupt */
  CMU_IRQn              = 24, /*!< 24 EFM32 CMU Interrupt */
  MSC_IRQn              = 25, /*!< 25 EFM32 MSC Interrupt */
  CRYPTO0_IRQn          = 26, /*!< 26 EFM32 CRYPTO0 Interrupt */
  LETIMER0_IRQn         = 27, /*!< 27 EFM32 LETIMER0 Interrupt */
  RTCC_IRQn             = 30, /*!< 30 EFM32 RTCC Interrupt */
  CRYOTIMER_IRQn        = 32, /*!< 32 EFM32 CRYOTIMER Interrupt */
  SMU_IRQn              = 35, /*!< 35 EFM32 SMU Interrupt */
  WTIMER0_IRQn          = 36, /*!< 36 EFM32 WTIMER0 Interrupt */
  WTIMER1_IRQn          = 37, /*!< 37 EFM32 WTIMER1 Interrupt */
  PCNT1_IRQn            = 38, /*!< 38 EFM32 PCNT1 Interrupt */
  PCNT2_IRQn            = 39, /*!< 39 EFM32 PCNT2 Interrupt */
  USART2_RX_IRQn        = 40, /*!< 40 EFM32 USART2_RX Interrupt */
  USART2_TX_IRQn        = 41, /*!< 41 EFM32 USART2_TX Interrupt */
  I2C1_IRQn             = 42, /*!< 42 EFM32 I2C1 Interrupt */
  USART3_RX_IRQn        = 43, /*!< 43 EFM32 USART3_RX Interrupt */
  USART3_TX_IRQn        = 44, /*!< 44 EFM32 USART3_TX Interrupt */
  VDAC0_IRQn            = 45, /*!< 45 EFM32 VDAC0 Interrupt */
  CSEN_IRQn             = 46, /*!< 46 EFM32 CSEN Interrupt */
  LESENSE_IRQn          = 47, /*!< 47 EFM32 LESENSE Interrupt */
  CRYPTO1_IRQn          = 48, /*!< 48 EFM32 CRYPTO1 Interrupt */
  TRNG0_IRQn            = 49, /*!< 49 EFM32 TRNG0 Interrupt */
} IRQn_Type;

#define CRYPTO_IRQn               CRYPTO0_IRQn /*!< Alias for CRYPTO0_IRQn */

/**************************************************************************//**
 * @defgroup EFM32JG12B500F512GL125_Core EFM32JG12B500F512GL125 Core
 * @{
 * @brief Processor and Core Peripheral Section
 *****************************************************************************/
#define __MPU_PRESENT             1 /**< Presence of MPU  */
#define __VTOR_PRESENT            1 /**< Presence of VTOR register in SCB */
#define __NVIC_PRIO_BITS          3 /**< NVIC interrupt priority bits */
#define __Vendor_SysTickConfig    0 /**< Is 1 if different SysTick counter is used */

